kakaZzzz/TonyWatch/STM32Cube_FW_F4_V1.3.0/Projects/STM32F4-Discovery/Templates/Src/main.c
/**
  ******************************************************************************
  * @file    Templates/Src/main.c 
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    26-June-2014
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "FreeRTOS.h"
#include "task.h"
#include "misc.h"
#include "cmsis_os.h"
#include <string.h>
#include "AFE4490.h"
#include "stm32f4_tony.h"
#include "ble_nus51422.h"
#include "stdio.h"

/** @addtogroup STM32F4xx_HAL_Examples
  * @{
  */

/** @addtogroup Templates
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define PACK_STATUS_HEADER 1
#define PACK_STATUS_BODY 2
#define HR_BLOCK0_BASE		0
#define HR_BLOCK1_BASE		(HR_BLOCK0_BASE+sizeof(sysTime))//8
#define HR_BLOCK2_BASE		(HR_BLOCK1_BASE+sizeof(hr_data_header_t)+gHeartRateValue.length)//23
#define HR_BLOCK3_BASE		(HR_BLOCK2_BASE+sizeof(hr_data_header_t)+gHeartRateRaw.length)//76


typedef struct
{
	uint32_t sec;
	uint32_t msec;
}hr_time_t;

typedef struct
{
	uint8_t type;
	hr_time_t time;
	uint16_t period;
	uint16_t length;
}hr_data_header_t;

static long * AFE44xxInitialData;
//static long * AFE44xxInitialData_ADDR;
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/


/* Private function prototypes -----------------------------------------------*/
static void SystemClock_Config(void);
void SendDataThread(void const *argument);
void HeartRateSendThread(void const *argument);
void packHeartRateData(osEvent data);
/*extern function prototypes---------------------------------*/
extern void  AFE44xx_Init(void);
extern long * AFE44xx_RecData(void);

osSemaphoreId xBinarySemaphore;
osSemaphoreId xBinSemaHeartRateSend;
osMessageQId xQueue;

uint8_t aPackHeader[]={0x01,0x23,0x45,0x67,0x89,0xAB,0xCD,0xEF,0xAA,0xBB};
uint8_t aPackHip[]={0xBB,0xAA,0xFE,0xDC,0xBA,0x98,0x76,0x54,0x32,0x10};
uint32_t gSystemTimeInS=0;
uint32_t gSystemTimeInMS=0;
uint8_t gHeartRateTxPackBuf[HR_PACK_LENGTH];
uint8_t gHeartRateTxPack[HR_PACK_LENGTH];
uint8_t gHeartRateTxPackCnt=0;
uint8_t gPackStatus;
uint16_t gHeartRate=121;
uint8_t gDataClass=0;
uint8_t gPackCnt=1;


	hr_data_header_t gHeartRateValue;
	hr_data_header_t gHeartRateRaw;
	hr_data_header_t gHeartRateProcess;
	
	hr_time_t sysTime;
/* Private functions ---------------------------------------------------------*/
/*-----------------------------------------------------------*/

static void prvSetupHardware( void )
{
	/* Setup STM32 system (clock, PLL and Flash configuration) */
	SystemInit();

	/* Ensure all priority bits are assigned as preemption priority bits. */
	NVIC_PriorityGroupConfig( NVIC_PriorityGroup_4 );

}

void vTask2a( void *pvParameters )
{
	volatile unsigned long ul;	
	for( ;; )
	{		
		BSP_LED_On(LED2);
		for( ul = 0; ul < 5000000; ul++ ) {
		}
		BSP_LED_Off(LED2);
		for( ul = 0; ul < 5000000; ul++ ) {
		}
	}
}

void vTask1a( void *pvParameters )
{
	volatile unsigned long ul;	
	for( ;; )
	{		
		BSP_LED_On(LED0);
		for( ul = 0; ul < 10000000; ul++ ) {
		}
		BSP_LED_Off(LED0);
		for( ul = 0; ul < 10000000; ul++ ) {
		}
	}
}

/*********************************************************************/
void  DelayuS( uint32_t uS )
{
	   uint32_t i;
	   for( i=0; i< uS; i++ )
		 {
				 __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP();
     }
}
/*********************************************************************

*********************************************************************/
void  DelayMS( uint32_t MS )
{
	   uint32_t i,loop;
	   loop = 1000*MS;
	   for( i=0; i< loop; i++ )
		 {
				 __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
     }	
}
/********************************************************************/
static void AFE44xxInterrupt_Init(void)
{
  HAL_NVIC_SetPriority(ADRDY_EXTI_IRQn,configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY, 0);//那1車?RTOS?ao‘那y米??D??車??豕??辰aD?車迆米豕車迆configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY
}	
/********************************************************************/
static void AFE44xxInterrupt_Enable(void)
{
  HAL_NVIC_EnableIRQ(ADRDY_EXTI_IRQn);
}	
/********************************************************************/
//static void AFE4490Interrupt_Disable(void)
//{
//	 HAL_NVIC_DisableIRQ(ADRDY_EXTI_IRQn);
//}	

