kakaZzzz/TonyWatch/STM32Cube_FW_F4_V1.3.0/Projects/STM32F4-Discovery/Templates/Src/main.c
/***********************************************************************************/
/***********************************************************************************/
/**
  * @brief  This function handles External line 4 interrupt request.
  * @param  None
  * @retval None
  */
void EXTI4_IRQHandler(void)
{
	static portBASE_TYPE xHigherPriorityTaskWoken;
  	HAL_GPIO_EXTI_IRQHandler(AFE44XX_ADRDY_PIN);//?“辰??D??辰y??㏒?GPIO?D?㏒那?????∩ㄓ﹞⊿﹞?那?
	xHigherPriorityTaskWoken = pdFALSE;
	xSemaphoreGiveFromISR(xBinarySemaphore, &xHigherPriorityTaskWoken);//﹞⊿3?芍???
	if(xHigherPriorityTaskWoken == pdTRUE)
	{
		vTaskSwitchContext();
	}	
}
/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
/*********************************************************/
//*******************************************************//
///*************** AFE44XX IT TASK  CONTROL FOR freeRTOS
//******************************************************//
void vHandlerAFE44xxITTASK(void const *argument)
{
	//portTickType xLastWakeTime;
	//xLastWakeTime = xTaskGetTickCount();
	//const portTickType xTicksToWait = 10/portTICK_RATE_MS;
	for(;;)
	{
		xSemaphoreTake(xBinarySemaphore,portMAX_DELAY); //??豕?芍???
		//xSemaphoreTake(xBinarySemaphore,xTicksToWait);
		AFE44xxInitialData = AFE44xx_RecData();
		//xQueueSendToBack(xQueue, &AFE44xxInitialData,portMAX_DELAY);
		osMessagePut (xQueue, (uint32_t)AFE44xxInitialData, portMAX_DELAY);
		osDelay(50);//		osDelay(10);
		//osDelayUntil(xLastWakeTime,10);
		// UART_printf(&huart1, (uint8_t*)printf_IT_sucess,COUNTOF(printf_IT_sucess)-1);
	}
}
void vReceiveAFE44xxDataTask(void const *argument)
{
	//    portBASE_TYPE xStatus;
	osEvent osEventAFE44XX;
	//portTickType xLastWakeTime;
	//xLastWakeTime = xTaskGetTickCount();
	//const portTickType xTicksToWait = 10/portTICK_RATE_MS;
	//uint8_t TxSample[128];
	//uint8_t *pPara1;
	//for(uint8_t i=0;i<128;i++)
	//{
	//	TxSample[i]=i;
	//}
	for(;;)
	{
		if(uxQueueMessagesWaiting(xQueue) !=0) //?D???車芍D?D那?﹞?車D那y?Y
		{
			//UART_printf(&huart1, (uint8_t*)printf_Queue_data_exist,COUNTOF(printf_Queue_data_exist)-1);
		}
		//xStatus = xQueueReceive(xQueue, &AFE44xxInitialData_ADDR,portMAX_DELAY);
		osEventAFE44XX = osMessageGet (xQueue, portMAX_DELAY);
		//if(xStatus == pdPASS)
		if(osEventAFE44XX.status == osEventMessage)
		{
			//sprintf(aTxBuffer_initialdata,"%lx\n%lx\n%lx\n",*AFE44xxInitialData_ADDR,*(AFE44xxInitialData_ADDR+1),*(AFE44xxInitialData_ADDR+2));
//in order to debug uart sending, weizhong comment the following two lines

//			sprintf(aTxBuffer_initialdata,"%lx\n%lx\n%lx\n",*(long *)osEventAFE44XX.value.v,*((long *)osEventAFE44XX.value.v+1),*((long *)osEventAFE44XX.value.v+2));
//			UART_printf(&huart1, (uint8_t *)aTxBuffer_initialdata,COUNTOF(aTxBuffer_initialdata)-1);  

//			pPara1=osEventAFE44XX.value.p;
//			if(flagBleConStatus==BLE_STATUS_CONNECTED)
//			{
//				TxSampleSend(aPackHeader,10);
//				TxSampleSend(pPara1,12);
//				TxSampleSend(aPackHip,10);
//			}

			packHeartRateData(osEventAFE44XX);
		}
		else
		{
			//UART_printf(&huart1, (uint8_t*)printf_Receiving_error,COUNTOF(printf_Receiving_error)-1);
		}
		osDelay(50);
	}
}
/*
Block0: 	0~7 		//start time,length=8B		offset=0
Block1:		8~22 		//data1,length=15B			offset=8
Block2:		23~75 		//data2,length=53B			offset=23
Block3:		76~128	//data3,length=53B			offset=76

*/

void initHeartRateDataType(void)
{
	gHeartRateValue.type=0x01;
	gHeartRateValue.time.sec=0;
	gHeartRateValue.time.msec=0;
	gHeartRateValue.period=500;
	gHeartRateValue.length=2;
	
	gHeartRateRaw.type=0x02;
	gHeartRateRaw.time.sec=0;
	gHeartRateRaw.time.msec=0;
	gHeartRateRaw.period=50;
	gHeartRateRaw.length=40;
	
	gHeartRateProcess.type=0x03;
	gHeartRateProcess.time.sec=0;
	gHeartRateProcess.time.msec=0;
	gHeartRateProcess.period=50;
	gHeartRateProcess.length=40;

	sysTime.sec=0x11223344;
	sysTime.msec=0x55667788;
}
	
void packHeartRateData(osEvent data)
{
	uint32_t data0=*((long *)data.value.v+0);
	uint32_t data1=*((long *)data.value.v+1);
//	uint32_t data2=*((long *)data.value.v+2);

	uint8_t ghr_block1_offset=0;
	uint8_t ghr_block2_offset=0;
	uint8_t ghr_block3_offset=0;
	
	if(gPackCnt==1)
	{
		memset(gHeartRateTxPack,0,HR_PACK_LENGTH);
		memcpy(gHeartRateTxPack+HR_BLOCK0_BASE,&sysTime,sizeof(sysTime));//start time
		
		memcpy(gHeartRateTxPack+HR_BLOCK1_BASE,&gHeartRateValue,sizeof(gHeartRateValue));
		ghr_block1_offset=HR_BLOCK1_BASE+sizeof(gHeartRateValue);
		memcpy(gHeartRateTxPack+ghr_block1_offset,&gHeartRate,sizeof(gHeartRate));
		
		memcpy(gHeartRateTxPack+HR_BLOCK2_BASE,&gHeartRateRaw,sizeof(gHeartRateRaw));
		ghr_block2_offset=HR_BLOCK2_BASE+sizeof(gHeartRateRaw);
		memcpy(gHeartRateTxPack+ghr_block2_offset,&data0,sizeof(data0));
		
		memcpy(gHeartRateTxPack+HR_BLOCK3_BASE,&gHeartRateProcess,sizeof(gHeartRateProcess));
		ghr_block3_offset=HR_BLOCK3_BASE+sizeof(gHeartRateProcess);
		memcpy(gHeartRateTxPack+ghr_block3_offset,&data1,sizeof(data1));
	}
	else if((gPackCnt>=2)&&(gPackCnt<=10))
	{
		memcpy(gHeartRateTxPack+ghr_block1_offset+sizeof(gHeartRate)*(gPackCnt-1),&gHeartRate,sizeof(gHeartRate));
		memcpy(gHeartRateTxPack+ghr_block2_offset+sizeof(gHeartRateRaw)*(gPackCnt-1),&gHeartRateRaw,sizeof(gHeartRateRaw));
		memcpy(gHeartRateTxPack+ghr_block3_offset+sizeof(gHeartRateProcess)*(gPackCnt-1),&gHeartRateProcess,sizeof(gHeartRateProcess));
	}
	else
	{
		
	}

	if(gPackCnt==10)
	{
		memcpy(gHeartRateTxPackBuf,gHeartRateTxPack,HR_PACK_LENGTH);
		gPackCnt=0;
		xSemaphoreGive(xBinSemaHeartRateSend);
	}
	gPackCnt++;
	/*
	switch(gPackStatus)
	{
		case PACK_STATUS_HEADER:
			//part1: start time
			gHeartRateTxPack[0+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInS,0);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[1+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInS,1);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[2+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInS,2);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[3+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInS,3);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[4+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInMS,0);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[5+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInMS,1);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[6+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInMS,2);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[7+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInMS,3);
			gHeartRateTxPackCnt++;
			//part2: data type
			gHeartRateTxPack[HR_BLOCK1_OFFSET+0]=0x01;
			gHeartRateTxPack[HR_BLOCK2_OFFSET+0]=0x02;
			gHeartRateTxPack[HR_BLOCK3_OFFSET+0]=0x03;
			//part3: data start time
			gHeartRateTxPack[HR_BLOCK1_OFFSET+1]=BREAK_UINT32(gSystemTimeInS,0);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+2]=BREAK_UINT32(gSystemTimeInS,1);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+3]=BREAK_UINT32(gSystemTimeInS,2);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+4]=BREAK_UINT32(gSystemTimeInS,3);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+5]=BREAK_UINT32(gSystemTimeInMS,4);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+6]=BREAK_UINT32(gSystemTimeInMS,5);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+7]=BREAK_UINT32(gSystemTimeInMS,6);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+8]=BREAK_UINT32(gSystemTimeInMS,7);
			
			gHeartRateTxPack[HR_BLOCK2_OFFSET+1]=BREAK_UINT32(gSystemTimeInS,0);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+2]=BREAK_UINT32(gSystemTimeInS,1);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+3]=BREAK_UINT32(gSystemTimeInS,2);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+4]=BREAK_UINT32(gSystemTimeInS,3);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+5]=BREAK_UINT32(gSystemTimeInMS,4);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+6]=BREAK_UINT32(gSystemTimeInMS,5);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+7]=BREAK_UINT32(gSystemTimeInMS,6);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+8]=BREAK_UINT32(gSystemTimeInMS,7);
			
