kakaZzzz/TonyWatch/STM32Cube_FW_F4_V1.3.0/Projects/STM32F4-Discovery/Templates/Src/main.c
			gHeartRateTxPack[HR_BLOCK3_OFFSET+1]=BREAK_UINT32(gSystemTimeInS,0);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+2]=BREAK_UINT32(gSystemTimeInS,1);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+3]=BREAK_UINT32(gSystemTimeInS,2);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+4]=BREAK_UINT32(gSystemTimeInS,3);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+5]=BREAK_UINT32(gSystemTimeInMS,4);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+6]=BREAK_UINT32(gSystemTimeInMS,5);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+7]=BREAK_UINT32(gSystemTimeInMS,6);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+8]=BREAK_UINT32(gSystemTimeInMS,7);
			//part4: data period
			gHeartRateTxPack[HR_BLOCK1_OFFSET+9]=0xf4;//0x01f4=500
			gHeartRateTxPack[HR_BLOCK1_OFFSET+10]=0x01;
			gHeartRateTxPack[HR_BLOCK2_OFFSET+9]=0x32;//0x0032=50
			gHeartRateTxPack[HR_BLOCK2_OFFSET+10]=0x00;
			gHeartRateTxPack[HR_BLOCK3_OFFSET+9]=0x32;//0x0032=50
			gHeartRateTxPack[HR_BLOCK3_OFFSET+10]=0x00;
			//part5: data length
			gHeartRateTxPack[HR_BLOCK1_OFFSET+11]=0x02;//0x0002=2
			gHeartRateTxPack[HR_BLOCK1_OFFSET+12]=0x00;
			gHeartRateTxPack[HR_BLOCK2_OFFSET+11]=0x28;//0x0028=40
			gHeartRateTxPack[HR_BLOCK2_OFFSET+12]=0x00;
			gHeartRateTxPack[HR_BLOCK3_OFFSET+11]=0x28;//0x0028=40
			gHeartRateTxPack[HR_BLOCK3_OFFSET+12]=0x00;
			//part6: data body 
			gHeartRateTxPack[HR_BLOCK1_OFFSET+13]=LO_UINT16(gHeartRate);//data1
			gHeartRateTxPack[HR_BLOCK1_OFFSET+14]=HI_UINT16(gHeartRate);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+13]=BREAK_UINT32(*((long *)data.value.v+0),0);//data2
			gHeartRateTxPack[HR_BLOCK2_OFFSET+14]=BREAK_UINT32(*((long *)data.value.v+0),1);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+15]=BREAK_UINT32(*((long *)data.value.v+0),2);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+16]=BREAK_UINT32(*((long *)data.value.v+0),3);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+13]=BREAK_UINT32(*((long *)data.value.v+1),0);//data3
			gHeartRateTxPack[HR_BLOCK3_OFFSET+14]=BREAK_UINT32(*((long *)data.value.v+1),1);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+15]=BREAK_UINT32(*((long *)data.value.v+1),2);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+16]=BREAK_UINT32(*((long *)data.value.v+1),3);
			gDataClass=1;
			break;
		case PACK_STATUS_BODY:
			if(gDataClass==1)
			{
				gHeartRateTxPack[HR_BLOCK1_OFFSET+15]=LO_UINT16(gHeartRate);
				gHeartRateTxPack[HR_BLOCK1_OFFSET+16]=HI_UINT16(gHeartRate);
				gHeartRateTxPack[HR_BLOCK2_OFFSET+17]=BREAK_UINT32(*((long *)data.value.v+0),0);//data2
				gHeartRateTxPack[HR_BLOCK2_OFFSET+18]=BREAK_UINT32(*((long *)data.value.v+0),1);
				gHeartRateTxPack[HR_BLOCK2_OFFSET+19]=BREAK_UINT32(*((long *)data.value.v+0),2);
				gHeartRateTxPack[HR_BLOCK2_OFFSET+20]=BREAK_UINT32(*((long *)data.value.v+0),3);
				gHeartRateTxPack[HR_BLOCK3_OFFSET+17]=BREAK_UINT32(*((long *)data.value.v+1),0);//data3
				gHeartRateTxPack[HR_BLOCK3_OFFSET+18]=BREAK_UINT32(*((long *)data.value.v+1),1);
				gHeartRateTxPack[HR_BLOCK3_OFFSET+19]=BREAK_UINT32(*((long *)data.value.v+1),2);
				gHeartRateTxPack[HR_BLOCK3_OFFSET+20]=BREAK_UINT32(*((long *)data.value.v+1),3);
			}
			else//gDataClass!=1
			{
				gHeartRateTxPack[]
				
			}
			break;
		default:
			break;
	}*/

}
/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
/*
	prvSetupHardware();
  HAL_Init();

  SystemClock_Config();
	BSP_LED_Init(LED3);//3.3V POWER
	BSP_LED_Init(LED0);
	BSP_LED_Init(LED1);
	BSP_LED_Init(LED2);
  	MX_GPIO_Init();
	MX_USART1_UART_Init();
	
debug_putchar(0x21);
debug_putchar(0x22);
debug_putchar(0x23);
debug_putchar(0x24);
debug_putchar(0x25);
debug_putchar(0x26);
debug_putchar(0x27);
 
  osThreadDef(USER_Thread, StartThread, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
  osThreadDef(Uart_TxThread_Name, UartTxThread, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
  osThreadDef(Uart_RxThread_Name, UartRxThread, osPriorityAboveNormal, 0, configMINIMAL_STACK_SIZE);
  osThreadCreate (osThread(USER_Thread), NULL);
  osThreadCreate (osThread(Uart_TxThread_Name), NULL);
  osThreadCreate (osThread(Uart_RxThread_Name), NULL);
*/

	osMessageQDef(AFE44XXMsg, 2, sizeof(long));
	vSemaphoreCreateBinary(xBinarySemaphore);
	vSemaphoreCreateBinary(xBinSemaHeartRateSend);

	prvSetupHardware();
	HAL_Init();
	SystemClock_Config();  

	BSP_LED_Init(LED3);
	BSP_LED_Init(LED0);
	BSP_LED_Init(LED1);
	BSP_LED_Init(LED2);

	MX_GPIO_Init();  

	MX_USART1_UART_Init();

	AFE44xx_Init();       
	AFE44xxInterrupt_Init();
	
 	initHeartRateDataType();
	
	xQueue = osMessageCreate (&os_messageQ_def_AFE44XXMsg, vHandlerAFE44xxITTASK);
	
	AFE44xxInterrupt_Enable()	;
	if(xBinarySemaphore != NULL)
	{

	/* Init code generated for FreeRTOS */
	/* Create Start thread */
	osThreadDef(USER_Thread, StartThread, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
	//osThreadDef(Uart_Thread_Name, UartThread, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
	osThreadCreate (osThread(USER_Thread), NULL);
	//osThreadCreate (osThread(Uart_Thread_Name), NULL);

	osThreadDef(AFE44xxIT_Thread_Name, vHandlerAFE44xxITTASK, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);	
	osThreadCreate (osThread(AFE44xxIT_Thread_Name), NULL);
		
	osThreadDef(vReceiveAFE44xxDataTask_Thread_Name, vReceiveAFE44xxDataTask, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);	
	osThreadCreate (osThread(vReceiveAFE44xxDataTask_Thread_Name), NULL);	
	osThreadDef(HRS_Thread_Name, HeartRateSendThread, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);	
	osThreadCreate (osThread(HRS_Thread_Name), NULL);
	
//	startUartRxThread();
	/* Start scheduler */
	osKernelStart(NULL, NULL);
  	}
	/* Infinite loop */
	while (1)
	{
		
	}
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 168000000
  *            HCLK(Hz)                       = 168000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = 8000000
  *            PLL_M                          = 8
  *            PLL_N                          = 336
  *            PLL_P                          = 2
  *            PLL_Q                          = 7
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 5
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  
